_org/_posts/devenv/2014-02-24-git-lu.org
#+begin_export html
---
layout: post
title: "Git 参考"
date: 2014-02-24
categories: 研发环境
tags:
    - Git
---
#+end_export

* 2. MSysGit 设置

** 2.1. 初始化配置：

进入 Git Bash，运行下列命令

#+begin_src sh
#配置 ID
git config --global user.name "your_id"
#配置 EMAIL
git config --global user.email "your_name@email_address"

# git 输出（比如 log、status）彩色显示
git config --global color.ui auto

# 全局配置 Git 不会进行换行符的转换
git config --global core.autocrlf false

# 全局配置文件权限
git config --global core.filemode false
#+end_src

** 2.2. 配置 SSH 证书：

*** 2.2.1. 新建 SSH 证书：

#+begin_src sh
ssh-keygen -t rsa -C "your_name@email_address"
#+end_src

*** 2.2.2. 恢复备份 SSH 证书：

1. 建立目录“~/.ssh“；
2. 复制备份的“id_rsa”(私钥) 和“id_rsa.pub”(公钥) 文件至目录“~/.ssh“；

*** 2.2.3. 通过 github 测试 SSH 证书：

#+begin_src sh
ssh -T git@github.com
#+end_src

如果看到“You've successfully authenticated, but GitHub does not provide shell access”信息，就表示连接成功。

** 2.3. 修改或新建 `/etc/fstab`，增加以下内容：

#+begin_src sh
d:/LinuxHome /home
d:/Works/Projects /projects
d:/Works/Codes /codes
e:/Downloads /dl
f:/Repositories/git /local_git
#+end_src

** 2.4. 设置全局配置文件 `/etc/profile`：

#+end_begin_src conf
# 定义语言环境变量
export LC_ALL=en_US.UTF-8
export LANG=en_US.UTF-8

# 定义用户 HOME 环境变量
#export HOME='/d/LinuxHome/xuan'
export VIM='/usr/share/vim'
export VIMRUNTIME='/usr/share/vim/vim74'

# 参数 --show-control-chars 正确显示中文
alias ls='ls -hF --color=tty --show-control-chars'                 # classify files in colour
alias dir='ls --color=auto --format=vertical'
alias vdir='ls --color=auto --format=long'
alias ll='ls -l'                              # long list
alias la='ls -A'                              # all but . and ..
alias l='ls -CF'                              #
#+end_src

** 2.5. 右键菜单打开 Cygwin 在当前目录

*** 2.5.1. 增加注册表项：

#+end_begin_src conf
Windows Registry Editor Version 5.00

[HKEY_CLASSES_ROOT\Directory\shell\opengit]
@="打开用 Git Bash"
[HKEY_CLASSES_ROOT\Directory\shell\opengit\command]
@="d:\\GSoft\\Linux32\\MinGW\\git\\git-bash.bat %V"
#+end_src

*** 2.5.2. 修改 `git-bash.bat` 文件，增加设置路径变量 `set _T=%*`：

#+begin_src sh
@echo off
set _T=%*
……
#+end_src

*** 2.5.3. 设置用户配置文件 `\home\${UserName}\.bash_profile`，在最后增加：

#+begin_src sh
# 右键菜单打开 Git 在当前目录
export _T=${_T//\\//}   # replace backslash to fowardslash
if [[ $_T == "" ]]; then
export _T=${HOME}
fi
cd "$_T"
#+end_src

* 3. Git 常用操作

** 3.1. 初始化服务仓库

*** 3.1.1. 初始化服务仓库，包括工作区，通常为本地仓库

#+begin_src sh
git init
#+end_src

*** 3.1.2. 初始化服务仓库，不包括工作区，通常为远程仓库

#+begin_src sh
git init  --bare
git init  --bare --shared
#+end_src

** 3.2. 增加文件快照到当前工作区

*** 3.2.1. 增加所有文件快照到当前工作区

#+begin_src sh
git add .
#+end_src

*** 3.2.2. 增加所有文件快照到当前工作区并更新索引为当前文件状态，通常因本地文件未使用 Git 更新删除。

#+begin_src sh
git add -A .
#+end_src

** 3.3. 删除文件从当前工作区和索引

#+begin_src sh
git rm app/user.rb
#+end_src

** 3.4. 重命名文件从当前工作区和索引

#+begin_src sh
git mv app/oldName.rb app/newName.rb
#+end_src

** 3.5. 提交文件快照到本地仓库

*** 3.5.1. 提交到本地仓库，已进行了文件快照

#+begin_src sh
git commit -m "commit information"
#+end_src

*** 3.5.2. 提交到本地仓库，未进行了文件快照（仓库已经存在文件）

#+begin_src sh
git commit -a -m 'commit information'
#+end_src

** 3.6. 查询当前工作区状态

#+begin_src sh
git status
#+end_src

** 3.7. 查询提交历史

#+begin_src sh
git log
#+end_src

** 3.8. 获取远程仓库克隆

*** 3.8.1. 获取远程仓库主库克隆

`git clone` 默认会把远程仓库整个给 `clone` 下来，但只会在本地默认创建一个 `master` 分支。

#+begin_src sh
git clone ssh://git@github.com/idxuan/GitTest
#+end_src

*** 3.8.2. 从远程仓库更新克隆

放弃本地版本，获取远程仓库最新版本

#+begin_src sh
git reset --hard
git pull
#+end_src

注：`git pull` 与 `git fetch` 的区别，`git pull` 相当于 `git fetch && git merge`

在远程仓库已经修改的情况下，本地也已经修改，那么需要通过一些方法避免同步更新错误，例如可以通过指定合并策略来接受远程修改，丢弃本地的所有修改：

#+begin_src sh
git pull -X theirs
#+end_src

其中 -X 指定合并策略是 “theirs" ，就是用别人的覆盖自己的。-s 默认就是 recursive，所以省略了。

