_posts/devenv/2014-02-24-git-lu.html
---
layout: post
title: "Git 参考"
date: 2014-02-24
categories: 研发环境
tags:
    - Git
---

<div id="outline-container-org9d9e644" class="outline-2">
<h2 id="org9d9e644"><span class="section-number-2">1</span> 2. MSysGit 设置</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf3b4d2d" class="outline-3">
<h3 id="orgf3b4d2d"><span class="section-number-3">1.1</span> 2.1. 初始化配置：</h3>
<div class="outline-text-3" id="text-1-1">
<p>
进入 Git Bash，运行下列命令
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#37197;&#32622; ID</span>
git config --global user.name <span style="color: #2d9574;">"your_id"</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#37197;&#32622; EMAIL</span>
git config --global user.email <span style="color: #2d9574;">"your_name@email_address"</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">git &#36755;&#20986;&#65288;&#27604;&#22914; log&#12289;status&#65289;&#24425;&#33394;&#26174;&#31034;</span>
git config --global color.ui auto

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20840;&#23616;&#37197;&#32622; Git &#19981;&#20250;&#36827;&#34892;&#25442;&#34892;&#31526;&#30340;&#36716;&#25442;</span>
git config --global core.autocrlf false

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20840;&#23616;&#37197;&#32622;&#25991;&#20214;&#26435;&#38480;</span>
git config --global core.filemode false
</pre>
</div>
</div>
</div>

<div id="outline-container-org629187b" class="outline-3">
<h3 id="org629187b"><span class="section-number-3">1.2</span> 2.2. 配置 SSH 证书：</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5f83a62" class="outline-4">
<h4 id="org5f83a62"><span class="section-number-4">1.2.1</span> 2.2.1. 新建 SSH 证书：</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-sh">ssh-keygen -t rsa -C <span style="color: #2d9574;">"your_name@email_address"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ada8a8" class="outline-4">
<h4 id="org6ada8a8"><span class="section-number-4">1.2.2</span> 2.2.2. 恢复备份 SSH 证书：</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>建立目录“~/.ssh“；</li>
<li>复制备份的“id_rsa”(私钥) 和“id_rsa.pub”(公钥) 文件至目录“~/.ssh“；</li>
</ol>
</div>
</div>

<div id="outline-container-org21705c4" class="outline-4">
<h4 id="org21705c4"><span class="section-number-4">1.2.3</span> 2.2.3. 通过 github 测试 SSH 证书：</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-sh">ssh -T git@github.com
</pre>
</div>

<p>
如果看到“You've successfully authenticated, but GitHub does not provide shell access”信息，就表示连接成功。
</p>
</div>
</div>
</div>

<div id="outline-container-org80f7df1" class="outline-3">
<h3 id="org80f7df1"><span class="section-number-3">1.3</span> 2.3. 修改或新建 `/etc/fstab`，增加以下内容：</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sh">d:/LinuxHome /home
d:/Works/Projects /projects
d:/Works/Codes /codes
e:/Downloads /dl
f:/Repositories/git /local_git
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce2fcfb" class="outline-3">
<h3 id="orgce2fcfb"><span class="section-number-3">1.4</span> 2.4. 设置全局配置文件 `/etc/profile`：</h3>
<div class="outline-text-3" id="text-1-4">
<p>
#+end_begin_src conf
</p>

<p>
export LC_ALL=en_US.UTF-8
export LANG=en_US.UTF-8
</p>

<p>
#export HOME='/d/LinuxHome/xuan'
export VIM='/usr/share/vim'
export VIMRUNTIME='/usr/share/vim/vim74'
</p>

<p>
alias ls='ls -hF &#x2013;color=tty &#x2013;show-control-chars'                 # classify files in colour
alias dir='ls &#x2013;color=auto &#x2013;format=vertical'
alias vdir='ls &#x2013;color=auto &#x2013;format=long'
alias ll='ls -l'                              # long list
alias la='ls -A'                              # all but . and ..
alias l='ls -CF'                              #
#+end_src
</p>
</div>
</div>

<div id="outline-container-orgab18056" class="outline-3">
<h3 id="orgab18056"><span class="section-number-3">1.5</span> 2.5. 右键菜单打开 Cygwin 在当前目录</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orge6a96f2" class="outline-4">
<h4 id="orge6a96f2"><span class="section-number-4">1.5.1</span> 2.5.1. 增加注册表项：</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
#+end_begin_src conf
Windows Registry Editor Version 5.00
</p>

<p>
[HKEY_CLASSES_ROOT\Directory\shell\opengit]
@="打开用 Git Bash"
[HKEY_CLASSES_ROOT\Directory\shell\opengit\command]
@="d:\\GSoft\\Linux32\\MinGW\\git\\git-bash.bat %V"
#+end_src
</p>
</div>
</div>

<div id="outline-container-orgfb485ba" class="outline-4">
<h4 id="orgfb485ba"><span class="section-number-4">1.5.2</span> 2.5.2. 修改 `git-bash.bat` 文件，增加设置路径变量 `set _T=%*`：</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-sh">@echo off
<span style="color: #4f97d7;">set</span> <span style="color: #7590db;">_T</span>=%*
&#8230;&#8230;
</pre>
</div>
</div>
</div>

<div id="outline-container-org759cc5e" class="outline-4">
<h4 id="org759cc5e"><span class="section-number-4">1.5.3</span> 2.5.3. 设置用户配置文件 `\home\${UserName}\.bash_profile`，在最后增加：</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21491;&#38190;&#33756;&#21333;&#25171;&#24320; Git &#22312;&#24403;&#21069;&#30446;&#24405;</span>
<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">_T</span>=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">_T</span>//<span style="color: #2d9574;">\\</span>//<span style="color: #4f97d7;">}</span>   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">replace backslash to fowardslash</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span> $<span style="color: #7590db;">_T</span> == <span style="color: #2d9574;">""</span> <span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">_T</span>=$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">HOME</span><span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
<span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$_T"</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcfda724" class="outline-2">
<h2 id="orgcfda724"><span class="section-number-2">2</span> 3. Git 常用操作</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6a5be9c" class="outline-3">
<h3 id="org6a5be9c"><span class="section-number-3">2.1</span> 3.1. 初始化服务仓库</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org97ec8a5" class="outline-4">
<h4 id="org97ec8a5"><span class="section-number-4">2.1.1</span> 3.1.1. 初始化服务仓库，包括工作区，通常为本地仓库</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-sh">git init
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a36275" class="outline-4">
<h4 id="org2a36275"><span class="section-number-4">2.1.2</span> 3.1.2. 初始化服务仓库，不包括工作区，通常为远程仓库</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-sh">git init  --bare
git init  --bare --shared
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6726d0b" class="outline-3">
<h3 id="org6726d0b"><span class="section-number-3">2.2</span> 3.2. 增加文件快照到当前工作区</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org99985d4" class="outline-4">
<h4 id="org99985d4"><span class="section-number-4">2.2.1</span> 3.2.1. 增加所有文件快照到当前工作区</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-sh">git add .
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ffb308" class="outline-4">
<h4 id="org2ffb308"><span class="section-number-4">2.2.2</span> 3.2.2. 增加所有文件快照到当前工作区并更新索引为当前文件状态，通常因本地文件未使用 Git 更新删除。</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-sh">git add -A .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3869830" class="outline-3">
<h3 id="org3869830"><span class="section-number-3">2.3</span> 3.3. 删除文件从当前工作区和索引</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">git rm app/user.rb
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e0a40a" class="outline-3">
<h3 id="org5e0a40a"><span class="section-number-3">2.4</span> 3.4. 重命名文件从当前工作区和索引</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh">git mv app/oldName.rb app/newName.rb
</pre>
</div>
</div>
</div>

<div id="outline-container-org351793b" class="outline-3">
<h3 id="org351793b"><span class="section-number-3">2.5</span> 3.5. 提交文件快照到本地仓库</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgc0111d4" class="outline-4">
<h4 id="orgc0111d4"><span class="section-number-4">2.5.1</span> 3.5.1. 提交到本地仓库，已进行了文件快照</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-sh">git commit -m <span style="color: #2d9574;">"commit information"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org696704c" class="outline-4">
<h4 id="org696704c"><span class="section-number-4">2.5.2</span> 3.5.2. 提交到本地仓库，未进行了文件快照（仓库已经存在文件）</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-sh">git commit -a -m <span style="color: #2d9574;">'commit information'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge1e05b1" class="outline-3">
<h3 id="orge1e05b1"><span class="section-number-3">2.6</span> 3.6. 查询当前工作区状态</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-sh">git status
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc27e7c4" class="outline-3">
<h3 id="orgc27e7c4"><span class="section-number-3">2.7</span> 3.7. 查询提交历史</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-sh">git log
</pre>
</div>
</div>
</div>

<div id="outline-container-org66d7b0e" class="outline-3">
<h3 id="org66d7b0e"><span class="section-number-3">2.8</span> 3.8. 获取远程仓库克隆</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-orgdf07f42" class="outline-4">
<h4 id="orgdf07f42"><span class="section-number-4">2.8.1</span> 3.8.1. 获取远程仓库主库克隆</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
`git clone` 默认会把远程仓库整个给 `clone` 下来，但只会在本地默认创建一个 `master` 分支。
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone ssh://git@github.com/idxuan/GitTest
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f53cc2" class="outline-4">
<h4 id="org2f53cc2"><span class="section-number-4">2.8.2</span> 3.8.2. 从远程仓库更新克隆</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
放弃本地版本，获取远程仓库最新版本
</p>

<div class="org-src-container">
<pre class="src src-sh">git reset --hard
git pull
</pre>
</div>

<p>
注：`git pull` 与 `git fetch` 的区别，`git pull` 相当于 `git fetch &amp;&amp; git merge`
</p>

<p>
在远程仓库已经修改的情况下，本地也已经修改，那么需要通过一些方法避免同步更新错误，例如可以通过指定合并策略来接受远程修改，丢弃本地的所有修改：
</p>

<div class="org-src-container">
<pre class="src src-sh">git pull -X theirs
</pre>
</div>

<p>
其中 -X 指定合并策略是 “theirs" ，就是用别人的覆盖自己的。-s 默认就是 recursive，所以省略了。
</p>
</div>
</div>
