_org/_posts/devenv/2014-02-24-git-lu.org
*** 3.8.3. 获取远程仓库分支克隆

查看远程分支信息。

#+begin_src sh
git branch –r
#+end_src

查看本地和远程分支信息。

#+begin_src sh
git branch –a
#+end_src

获取远程分支到本地，参数 `-t` 设置为本地当前分支。

#+begin_src sh
git checkout -t origin/other_branch
#+end_src

** 3.9. 增加远程仓库配置

#+begin_src sh
git remote add github git@github.com:idxuan/GitTest.git (推荐)
git remote add github https://github.com/idxuan/GitTest.git
git remote add local file://f:/Repositories/git/conv_dict
#+end_src

** 3.10. 删除远程仓库配置

#+begin_src sh
git remote rm github
#+end_src

** 3.11. 远程仓库重命名

#+begin_src sh
git remote rename oldname newname
#+end_src

** 3.12. 修改远程仓库路径

#+begin_src sh
git remote set-url github git@github.com:idxuan/GitTest.git
#+end_src

** 3.13. 查询远程仓库配置

#+begin_src sh
git remote -v
#+end_src

** 3.14. 获取远程仓库

#+begin_src sh
git pull 远端仓库名 远端分支名:本地分支名
git pull github master
#+end_src

** 3.15. 提交到远程仓库

#+begin_src sh
git push 远端仓库名 本地分支名:远端分支名
git push github master
git push -u github master
#+end_src

** 3.16. 创建一个没有父节点的分支（github 规定，只有该分支中的页面，才会生成网页文件）

#+begin_src sh
git checkout --orphan gh-pages
#+end_src

** 3.17. 重置回滚

重置回滚本地

#+begin_src sh
git reset --hard 版本号
#+end_src

重置回滚远程

#+begin_src sh
git push -f
#+end_src

然后每个本地都要执行 `git reset --hard 版本号` 操作。
该方法只适合小的团队或者个人的项目使用，大的团队还是建议 `git reset --hard`版本号，然后比较多所有有变动的文件，然后覆盖回去，然后提交(commit)，然后 push 的远程。

** 3.18. 强制覆盖本地文件

1. `git fetch` 下载远程最新的，但不尝试或修改任何东西。 然后 `git reset master` 分支重置到刚才。

#+begin_src sh
git fetch --all
git reset --hard origin/master
#+end_src


2. 试试这个。

#+begin_src sh
git reset --hard HEAD
git pull
#+end_src


3. clean -f 如果您有未跟踪目录，还需要-d 选项。

#+begin_src sh
git reset --hard HEAD
git clean -f -d
git pull
#+end_src

* 4. GitHub 创建步骤

** 4.1 Create a new repository on the command line

#+begin_src sh
touch README.md
git init
git add README.md
git commit -m "first commit"
git remote add origin https://github.com/idxuan/vimim_dict.git
git push -u origin master
#+end_src

** 4.2 Push an existing repository from the command line

#+begin_src sh
git remote add origin https://github.com/idxuan/vimim_dict.git
git push -u origin master
#+end_src

* 5. Git 忽略文件

Git 忽略文件有 3 种设置方式：

** 5.1. 方式一

在仓库目录下新建一个名为.gitignore 的文件（因为是点开头，可能没办法直接在 windows 目录下直接创建，必须通过右键 Git Bash，按照 linux 的方式来新建.gitignore 文件）。
.gitignore 文件对其所在的目录及所在目录的全部子目录均有效。通过将.gitignore 文件添加到仓库，其他开发者更新该文件到本地仓库，以共享同一套忽略规则。

** 5.2. 方式二

通过配置.git/info/exclude 文件来忽略文件。这种方式对仓库全局有效，只能对自己本地仓库有作用，其他人没办法通过这种方式来共享忽略规则，除非他人也修改其本地仓库的该文件。

** 5.3. 方式三

通过.git/config 配置文件的 core. Excludesfile 选项，指定一个忽略规则文件（完整路径）。忽略规则在文件中（当然该文件名可以任意取），该方式的作用域是也全局的。

** 5.4. 忽略样例

#+end_begin_src conf
#忽略掉所有文件名是 foo.txt 的文件
foo.txt
#忽略所有生成的 html 文件,
*.html
#foo.html 是手工维护的，所以例外
!foo.html
#忽略所有.o 和 .a 文件
*.[oa]
#忽略 foo 目录
foo/
#忽略所有 foo.txt 以外文件.
!foo.txt
#+end_src

* 6. Git Config 配置项

** 6.1 默认远程仓库

#+begin_src sh
git config branch.master.remote origin
#+end_src

* 7. Git 使用点滴

** 7.1 系统警告：`LF will be replaced by CRLF`

**原因分析：**

各操作系统在文本文件中使用的换行符并不一致，如下：

- `CRLF` 就是回车换行符，一般 Windows 系统使用；
- `CR` 就是回车符，一般 Mac 系统使用；
- `LF` 就是换行符，一般 Unix/Linux 系统使用；

在 Windows 系统中使用 Git 来生成一个项目，如果文件中的换行符为 `LF`， 当执行`git add .`时，系统提示：`LF` 将被转换成 `CRLF`。

**解决方法：**

删除生成的.git 文件（删除 Git 仓库）

#+begin_src sh
rm -rf .git
#+end_src

全局配置 Git 不会进行换行符的转换

#+begin_src sh
git config --global core.autocrlf false
#+end_src

最后重新执行

#+begin_src sh
git init
git add .
#+end_src

** 7.2 系统错误：`failed to push some refs to`

**原因分析：**

远程仓库中代码版本与本地不一致冲突导致。

**解决方法：**

1. git pull github master
2. 自动 merge 或手动 merge 冲突
3. git push github master

** 7.2 系统错误：`commit your changes or stash them before you can merge`

**原因分析：**

更新本地代码时远程仓库中代码版本与本地不一致冲突导致。

**解决方法：**

*** 7.2.1 放弃本地版本，获取远程仓库最新版本

#+begin_src sh
git reset --hard
git pull
#+end_src

其中 `git reset` 是针对版本,如果想针对文件回退本地修改,使用

#+end_src
git checkout HEAD file/to/restore
#+end_src

*** 7.2.2 使用 `git stash` 保留生产服务器上所做的改动,仅仅并入新配置项。

#+begin_src sh
git stash
git pull
git stash pop
#+end_src

然后可以使用 `git diff -w +filename` 来确认代码自动合并的情况，并作出相应修改。

- git stash: 备份当前的工作区的内容，从最近的一次提交中读取相关内容，让工作区保证和上次提交的内容一致。同时，将当前的工作区内容保存到 Git 栈中。
- git stash pop: 从 Git 栈中读取最近一次保存的内容，恢复工作区的相关内容。由于可能存在多个 Stash 的内容，所以用栈来管理，pop 会从最近的一个 stash 中读取内容并恢复。
- git stash list: 显示 Git 栈内的所有备份，可以利用这个列表来决定从那个地方恢复。
- git stash clear: 清空 Git 栈。此时使用 gitg 等图形化工具会发现，原来 stash 的哪些节点都消失了。

