_posts/devenv/2014-02-24-git-lu.html

<div id="outline-container-org37f0ea4" class="outline-4">
<h4 id="org37f0ea4"><span class="section-number-4">2.8.3</span> 3.8.3. 获取远程仓库分支克隆</h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
查看远程分支信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">git branch &#8211;r
</pre>
</div>

<p>
查看本地和远程分支信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">git branch &#8211;a
</pre>
</div>

<p>
获取远程分支到本地，参数 `-t` 设置为本地当前分支。
</p>

<div class="org-src-container">
<pre class="src src-sh">git checkout -t origin/other_branch
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge741e42" class="outline-3">
<h3 id="orge741e42"><span class="section-number-3">2.9</span> 3.9. 增加远程仓库配置</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-sh">git remote add github git@github.com:idxuan/GitTest.git <span style="color: #4f97d7;">(</span>&#25512;&#33616;<span style="color: #4f97d7;">)</span>
git remote add github https://github.com/idxuan/GitTest.git
git remote add local file://f:/Repositories/git/conv_dict
</pre>
</div>
</div>
</div>

<div id="outline-container-org90a3b1c" class="outline-3">
<h3 id="org90a3b1c"><span class="section-number-3">2.10</span> 3.10. 删除远程仓库配置</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-sh">git remote rm github
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fda774" class="outline-3">
<h3 id="org0fda774"><span class="section-number-3">2.11</span> 3.11. 远程仓库重命名</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-sh">git remote rename oldname newname
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc190148" class="outline-3">
<h3 id="orgc190148"><span class="section-number-3">2.12</span> 3.12. 修改远程仓库路径</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-sh">git remote set-url github git@github.com:idxuan/GitTest.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org10405ae" class="outline-3">
<h3 id="org10405ae"><span class="section-number-3">2.13</span> 3.13. 查询远程仓库配置</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">
<pre class="src src-sh">git remote -v
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7cd641" class="outline-3">
<h3 id="orge7cd641"><span class="section-number-3">2.14</span> 3.14. 获取远程仓库</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-sh">git pull &#36828;&#31471;&#20179;&#24211;&#21517; &#36828;&#31471;&#20998;&#25903;&#21517;:&#26412;&#22320;&#20998;&#25903;&#21517;
git pull github master
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1d7964" class="outline-3">
<h3 id="orgb1d7964"><span class="section-number-3">2.15</span> 3.15. 提交到远程仓库</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre class="src src-sh">git push &#36828;&#31471;&#20179;&#24211;&#21517; &#26412;&#22320;&#20998;&#25903;&#21517;:&#36828;&#31471;&#20998;&#25903;&#21517;
git push github master
git push -u github master
</pre>
</div>
</div>
</div>

<div id="outline-container-org541d0ea" class="outline-3">
<h3 id="org541d0ea"><span class="section-number-3">2.16</span> 3.16. 创建一个没有父节点的分支（github 规定，只有该分支中的页面，才会生成网页文件）</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">
<pre class="src src-sh">git checkout --orphan gh-pages
</pre>
</div>
</div>
</div>

<div id="outline-container-orga47cae5" class="outline-3">
<h3 id="orga47cae5"><span class="section-number-3">2.17</span> 3.17. 重置回滚</h3>
<div class="outline-text-3" id="text-2-17">
<p>
重置回滚本地
</p>

<div class="org-src-container">
<pre class="src src-sh">git reset --hard &#29256;&#26412;&#21495;
</pre>
</div>

<p>
重置回滚远程
</p>

<div class="org-src-container">
<pre class="src src-sh">git push -f
</pre>
</div>

<p>
然后每个本地都要执行 `git reset &#x2013;hard 版本号` 操作。
该方法只适合小的团队或者个人的项目使用，大的团队还是建议 `git reset &#x2013;hard`版本号，然后比较多所有有变动的文件，然后覆盖回去，然后提交(commit)，然后 push 的远程。
</p>
</div>
</div>

<div id="outline-container-org433c90b" class="outline-3">
<h3 id="org433c90b"><span class="section-number-3">2.18</span> 3.18. 强制覆盖本地文件</h3>
<div class="outline-text-3" id="text-2-18">
<ol class="org-ol">
<li>`git fetch` 下载远程最新的，但不尝试或修改任何东西。 然后 `git reset master` 分支重置到刚才。</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">git fetch --all
git reset --hard origin/master
</pre>
</div>


<ol class="org-ol">
<li>试试这个。</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">git reset --hard HEAD
git pull
</pre>
</div>


<ol class="org-ol">
<li>clean -f 如果您有未跟踪目录，还需要-d 选项。</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">git reset --hard HEAD
git clean -f -d
git pull
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge3ea965" class="outline-2">
<h2 id="orge3ea965"><span class="section-number-2">3</span> 4. GitHub 创建步骤</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc908d16" class="outline-3">
<h3 id="orgc908d16"><span class="section-number-3">3.1</span> 4.1 Create a new repository on the command line</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">touch README.md
git init
git add README.md
git commit -m <span style="color: #2d9574;">"first commit"</span>
git remote add origin https://github.com/idxuan/vimim_dict.git
git push -u origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb65847b" class="outline-3">
<h3 id="orgb65847b"><span class="section-number-3">3.2</span> 4.2 Push an existing repository from the command line</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">git remote add origin https://github.com/idxuan/vimim_dict.git
git push -u origin master
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga5a0e3d" class="outline-2">
<h2 id="orga5a0e3d"><span class="section-number-2">4</span> 5. Git 忽略文件</h2>
<div class="outline-text-2" id="text-4">
<p>
Git 忽略文件有 3 种设置方式：
</p>
</div>

<div id="outline-container-org85b7d36" class="outline-3">
<h3 id="org85b7d36"><span class="section-number-3">4.1</span> 5.1. 方式一</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在仓库目录下新建一个名为.gitignore 的文件（因为是点开头，可能没办法直接在 windows 目录下直接创建，必须通过右键 Git Bash，按照 linux 的方式来新建.gitignore 文件）。
.gitignore 文件对其所在的目录及所在目录的全部子目录均有效。通过将.gitignore 文件添加到仓库，其他开发者更新该文件到本地仓库，以共享同一套忽略规则。
</p>
</div>
</div>

<div id="outline-container-orge335576" class="outline-3">
<h3 id="orge335576"><span class="section-number-3">4.2</span> 5.2. 方式二</h3>
<div class="outline-text-3" id="text-4-2">
<p>
通过配置.git/info/exclude 文件来忽略文件。这种方式对仓库全局有效，只能对自己本地仓库有作用，其他人没办法通过这种方式来共享忽略规则，除非他人也修改其本地仓库的该文件。
</p>
</div>
</div>

<div id="outline-container-org43c971c" class="outline-3">
<h3 id="org43c971c"><span class="section-number-3">4.3</span> 5.3. 方式三</h3>
<div class="outline-text-3" id="text-4-3">
<p>
通过.git/config 配置文件的 core. Excludesfile 选项，指定一个忽略规则文件（完整路径）。忽略规则在文件中（当然该文件名可以任意取），该方式的作用域是也全局的。
</p>
</div>
</div>

<div id="outline-container-org496c4c6" class="outline-3">
<h3 id="org496c4c6"><span class="section-number-3">4.4</span> 5.4. 忽略样例</h3>
<div class="outline-text-3" id="text-4-4">
<p>
#+end_begin_src conf
#忽略掉所有文件名是 foo.txt 的文件
foo.txt
#忽略所有生成的 html 文件,
*.html
#foo.html 是手工维护的，所以例外
!foo.html
#忽略所有.o 和 .a 文件
*.[oa]
#忽略 foo 目录
foo/
#忽略所有 foo.txt 以外文件.
!foo.txt
#+end_src
</p>
</div>
</div>
</div>

<div id="outline-container-org95a6d01" class="outline-2">
<h2 id="org95a6d01"><span class="section-number-2">5</span> 6. Git Config 配置项</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7cda0fc" class="outline-3">
<h3 id="org7cda0fc"><span class="section-number-3">5.1</span> 6.1 默认远程仓库</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh">git config branch.master.remote origin
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga73b5c7" class="outline-2">
<h2 id="orga73b5c7"><span class="section-number-2">6</span> 7. Git 使用点滴</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgdd294d5" class="outline-3">
<h3 id="orgdd294d5"><span class="section-number-3">6.1</span> 7.1 系统警告：`LF will be replaced by CRLF`</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<b><b>原因分析：</b></b>
</p>

<p>
各操作系统在文本文件中使用的换行符并不一致，如下：
</p>

<ul class="org-ul">
<li>`CRLF` 就是回车换行符，一般 Windows 系统使用；</li>
<li>`CR` 就是回车符，一般 Mac 系统使用；</li>
<li>`LF` 就是换行符，一般 Unix/Linux 系统使用；</li>
</ul>

<p>
在 Windows 系统中使用 Git 来生成一个项目，如果文件中的换行符为 `LF`， 当执行`git add .`时，系统提示：`LF` 将被转换成 `CRLF`。
</p>

<p>
<b><b>解决方法：</b></b>
</p>

<p>
删除生成的.git 文件（删除 Git 仓库）
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -rf .git
</pre>
</div>

<p>
全局配置 Git 不会进行换行符的转换
</p>

<div class="org-src-container">
<pre class="src src-sh">git config --global core.autocrlf false
</pre>
</div>

<p>
最后重新执行
</p>

<div class="org-src-container">
<pre class="src src-sh">git init
git add .
</pre>
</div>
</div>
</div>

<div id="outline-container-org9807c07" class="outline-3">
<h3 id="org9807c07"><span class="section-number-3">6.2</span> 7.2 系统错误：`failed to push some refs to`</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b><b>原因分析：</b></b>
</p>

<p>
远程仓库中代码版本与本地不一致冲突导致。
</p>

<p>
<b><b>解决方法：</b></b>
</p>

<ol class="org-ol">
<li>git pull github master</li>
<li>自动 merge 或手动 merge 冲突</li>
<li>git push github master</li>
</ol>
</div>
</div>

<div id="outline-container-org30fceab" class="outline-3">
<h3 id="org30fceab"><span class="section-number-3">6.3</span> 7.2 系统错误：`commit your changes or stash them before you can merge`</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<b><b>原因分析：</b></b>
</p>

<p>
更新本地代码时远程仓库中代码版本与本地不一致冲突导致。
</p>

<p>
<b><b>解决方法：</b></b>
</p>
</div>

<div id="outline-container-orgec6fa94" class="outline-4">
<h4 id="orgec6fa94"><span class="section-number-4">6.3.1</span> 7.2.1 放弃本地版本，获取远程仓库最新版本</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-sh">git reset --hard
git pull
</pre>
</div>

<p>
其中 `git reset` 是针对版本,如果想针对文件回退本地修改,使用
</p>

<p>
#+end_src
git checkout HEAD file/to/restore
#+end_src
</p>
</div>
</div>

<div id="outline-container-org507ba3a" class="outline-4">
<h4 id="org507ba3a"><span class="section-number-4">6.3.2</span> 7.2.2 使用 `git stash` 保留生产服务器上所做的改动,仅仅并入新配置项。</h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">
<pre class="src src-sh">git stash
git pull
git stash pop
</pre>
</div>

<p>
然后可以使用 `git diff -w +filename` 来确认代码自动合并的情况，并作出相应修改。
</p>

<ul class="org-ul">
<li>git stash: 备份当前的工作区的内容，从最近的一次提交中读取相关内容，让工作区保证和上次提交的内容一致。同时，将当前的工作区内容保存到 Git 栈中。</li>
<li>git stash pop: 从 Git 栈中读取最近一次保存的内容，恢复工作区的相关内容。由于可能存在多个 Stash 的内容，所以用栈来管理，pop 会从最近的一个 stash 中读取内容并恢复。</li>
<li>git stash list: 显示 Git 栈内的所有备份，可以利用这个列表来决定从那个地方恢复。</li>
<li>git stash clear: 清空 Git 栈。此时使用 gitg 等图形化工具会发现，原来 stash 的哪些节点都消失了。</li>
</ul>
</div>
</div>
</div>
