_org/_posts/devenv/2014-02-24-git-lu.org
** 7.3 关于回滚

Git 的历史记录是不可修改的，也就是不能更改任何已经发生的事情。
任何操作都只是在原来的操作上修改。也就是说，即使删除了一个分支，修改了一个提交，或者强制重置，仍然可以回滚这些操作。

样例：

#+begin_src sh
$ git init
$ touch foo.txt
$ git add foo.txt
$ git commit -m "initial commit"

$ echo 'new data' >> foo.txt
$ git commit -a -m "more stuff added to foo"
#+end_src

现在看 Git 的历史记录，可以看到两次提交：

#+begin_src sh
$ git log
98abc5a (HEAD, master) more stuff added to foo
b7057a9 initial commit
#+end_src

现在重置回第一次提交的状态：

#+begin_src sh
$ git reset --hard b7057a9
$ git log
b7057a9 (HEAD, master) initial commit
#+end_src

这看起来是丢掉了第二次的提交，没有办法找回来了。但是 `reflog` 就是用来解决这个问题的。简单的说，它会记录所有 `HEAD` 的历史，也就是说当做 `reset`，`checkout`等操作的时候，这些操作会被记录在 `reflog` 中。

#+begin_src sh
$ git reflog
b7057a9 HEAD@{0}: reset: moving to b7057a9
98abc5a HEAD@{1}: commit: more stuff added to foo
b7057a9 HEAD@{2}: commit (initial): initial commit
#+end_src

所以要找回第二次 `commit`，只需要做如下操作：

#+begin_src sh
$ git reset --hard 98abc5a
#+end_src

再来看一下 Git 记录：

#+begin_src sh
$ git log
98abc5a (HEAD, master) more stuff added to foo
b7057a9 initial commit
#+end_src

所以如果因为 `reset` 等操作丢失一个提交的时候，总是可以把它找回来。除非操作已经被 Git 当做垃圾处理掉了，一般是 30 天以后。

** 7.4 Clone 错误 `does not appear to be a git repository`

Clone 用绝对路径，不要使用相对路径
错误：git@ip:gitosis-admin.git
正确：git@ip:/home/git/repositories/gitosis-admin.git

* References

#+begin_quote
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
#+end_quote
