_posts/devenv/2014-02-24-git-lu.html

<div id="outline-container-org1c6cf4a" class="outline-3">
<h3 id="org1c6cf4a"><span class="section-number-3">6.4</span> 7.3 关于回滚</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Git 的历史记录是不可修改的，也就是不能更改任何已经发生的事情。
任何操作都只是在原来的操作上修改。也就是说，即使删除了一个分支，修改了一个提交，或者强制重置，仍然可以回滚这些操作。
</p>

<p>
样例：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git init
$ touch foo.txt
$ git add foo.txt
$ git commit -m <span style="color: #2d9574;">"initial commit"</span>

$ echo <span style="color: #2d9574;">'new data'</span> &gt;&gt; foo.txt
$ git commit -a -m <span style="color: #2d9574;">"more stuff added to foo"</span>
</pre>
</div>

<p>
现在看 Git 的历史记录，可以看到两次提交：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git log
<span style="color: #a45bad;">98abc5a</span> <span style="color: #4f97d7;">(</span>HEAD, master<span style="color: #4f97d7;">)</span> more stuff added to foo
b7057a9 initial commit
</pre>
</div>

<p>
现在重置回第一次提交的状态：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git reset --hard b7057a9
$ git log
<span style="color: #bc6ec5; font-weight: bold;">b7057a9</span> <span style="color: #4f97d7;">(</span>HEAD, master<span style="color: #4f97d7;">)</span> initial commit
</pre>
</div>

<p>
这看起来是丢掉了第二次的提交，没有办法找回来了。但是 `reflog` 就是用来解决这个问题的。简单的说，它会记录所有 `HEAD` 的历史，也就是说当做 `reset`，`checkout`等操作的时候，这些操作会被记录在 `reflog` 中。
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git reflog
b7057a9 HEAD@<span style="color: #4f97d7;">{</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">}</span>: reset: moving to b7057a9
<span style="color: #a45bad;">98abc5a</span> HEAD@<span style="color: #4f97d7;">{</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">}</span>: commit: more stuff added to foo
b7057a9 HEAD@<span style="color: #4f97d7;">{</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">}</span>: commit <span style="color: #4f97d7;">(</span>initial<span style="color: #4f97d7;">)</span>: initial commit
</pre>
</div>

<p>
所以要找回第二次 `commit`，只需要做如下操作：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git reset --hard <span style="color: #a45bad;">98abc5a</span>
</pre>
</div>

<p>
再来看一下 Git 记录：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git log
<span style="color: #a45bad;">98abc5a</span> <span style="color: #4f97d7;">(</span>HEAD, master<span style="color: #4f97d7;">)</span> more stuff added to foo
b7057a9 initial commit
</pre>
</div>

<p>
所以如果因为 `reset` 等操作丢失一个提交的时候，总是可以把它找回来。除非操作已经被 Git 当做垃圾处理掉了，一般是 30 天以后。
</p>
</div>
</div>

<div id="outline-container-org11813b4" class="outline-3">
<h3 id="org11813b4"><span class="section-number-3">6.5</span> 7.4 Clone 错误 `does not appear to be a git repository`</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Clone 用绝对路径，不要使用相对路径
错误：git@ip:gitosis-admin.git
正确：git@ip:/home/git/repositories/gitosis-admin.git
</p>
</div>
</div>
</div>

<div id="outline-container-org52c40ed" class="outline-2">
<h2 id="org52c40ed"><span class="section-number-2">7</span> References</h2>
<div class="outline-text-2" id="text-7">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>
</blockquote>
</div>
</div>
